# St7GetNumSRABaseCases

Returns the number of Base Excitation cases assigned for Spectral Response Analysis.

long St7GetNumSRABaseCases(long uID, long* NumCases)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumCases

Number of base excitation cases.